recipes/souffle-pancakes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Souffle Pancakes</title>
<meta name="author" content="james" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Souffle Pancakes</h1>

<div id="outline-container-orgbf91c90" class="outline-2">
<h2 id="orgbf91c90">Ingredients</h2>
<div class="outline-text-2" id="text-orgbf91c90">
</div>
<div id="outline-container-org9439b16" class="outline-3">
<h3 id="org9439b16">Wet</h3>
<div class="outline-text-3" id="text-org9439b16">
<ul class="org-ul">
<li>100 mL oat milk</li>
<li>100 mL soda water</li>
<li>2 tbsp apple-cider vinegar</li>
<li>2 tbsp vegetable oil</li>
<li>1 tsp vanilla extract</li>
</ul>
</div>
</div>

<div id="outline-container-org78bf01f" class="outline-3">
<h3 id="org78bf01f">Dry</h3>
<div class="outline-text-3" id="text-org78bf01f">
<ul class="org-ul">
<li>200 g plain flour</li>
<li>50 g icing sugar</li>
<li>2 tsp baking powder</li>
<li>1/2 tsp bicarb soda</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org168c39e" class="outline-2">
<h2 id="org168c39e">Instructions</h2>
<div class="outline-text-2" id="text-org168c39e">
<ol class="org-ol">
<li>Combine all the wet ingredients in a jug and leave to stand for  5 minutes. The mixture will thicken slightly.</li>
<li>Sift all the dry ingredients into a medium mixing bowl with a pinch of salt and make a well in the middle. Pour the wet mixture into the dry and, using a spatula, gently fold the dry into the wet, mixing only until there are no visible dry spots.You need to keep the mixture light and airy for this to work.</li>
<li>Spray a frying pan with non-stick pray and warm over a low heat for a few minutes. For these pancakes to do the whole souffle thing, they need the assistance of metal ring moulds. The higher the sides the higher you can get your pancakes. Spray the inside of the ring moulds and place into the pan. Fill with 2-3 tbsp of the mixture, depending on how high you'd like them.</li>
<li>Once the mix is in and level, place a lid on the pan and allow to cook fro 5 minutes. Remove the lid and flip the pancake while still in the mould.Place the lid back on the pan and cook for another 2 minutes. To test whether they are cooked through, press on the top of a pancake - if there is slight resistance, you should be good to go. Repeat to make remaining pancakes.</li>
<li>Top with whatever you damn well please.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
